templates/bir11logout.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
xmlns:ns="http://CIS/BIR/PUBL/2014/07">
<soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
<wsa:To>{url}</wsa:To>
<wsa:Action>{action}</wsa:Action>
</soap:Header>
<soap:Body>
<ns:Wyloguj>
<ns:pIdentyfikatorSesji>{sid}</ns:pIdentyfikatorSesji>
</ns:Wyloguj>
</soap:Body>
</soap:Envelope>