dist/envelopes.js

"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.envelopeDaneSzukajPodmioty = exports.envelopeWyloguj = exports.envelopeZaloguj = void 0;
var envelopeZaloguj = function (key) { return "\n<soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:ns=\"http://CIS/BIR/PUBL/2014/07\">\n    <soap:Header xmlns:wsa=\"http://www.w3.org/2005/08/addressing\">\n        <wsa:To>https://wyszukiwarkaregon.stat.gov.pl/wsBIR/UslugaBIRzewnPubl.svc</wsa:To>\n        <wsa:Action>http://CIS/BIR/PUBL/2014/07/IUslugaBIRzewnPubl/Zaloguj</wsa:Action>\n    </soap:Header>\n    <soap:Body>\n        <ns:Zaloguj>\n            <ns:pKluczUzytkownika>".concat(key, "</ns:pKluczUzytkownika>\n        </ns:Zaloguj>\n    </soap:Body>\n</soap:Envelope>\n"); };
exports.envelopeZaloguj = envelopeZaloguj;
var envelopeWyloguj = function (sid) { return "\n<soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:ns=\"http://CIS/BIR/PUBL/2014/07\">\n    <soap:Header xmlns:wsa=\"http://www.w3.org/2005/08/addressing\">\n        <wsa:To>https://wyszukiwarkaregon.stat.gov.pl/wsBIR/UslugaBIRzewnPubl.svc</wsa:To>\n        <wsa:Action>http://CIS/BIR/PUBL/2014/07/IUslugaBIRzewnPubl/Wyloguj</wsa:Action>\n    </soap:Header>\n    <soap:Body>\n        <ns:Wyloguj>\n            <ns:pIdentyfikatorSesji>".concat(sid, "</ns:pIdentyfikatorSesji>\n        </ns:Wyloguj>\n    </soap:Body>\n</soap:Envelope>\n"); };
exports.envelopeWyloguj = envelopeWyloguj;
var envelopeDaneSzukajPodmioty = function (params) { return "\n<soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:ns=\"http://CIS/BIR/PUBL/2014/07\" xmlns:dat=\"http://CIS/BIR/PUBL/2014/07/DataContract\">\n    <soap:Header xmlns:wsa=\"http://www.w3.org/2005/08/addressing\">\n        <wsa:To>https://wyszukiwarkaregon.stat.gov.pl/wsBIR/UslugaBIRzewnPubl.svc</wsa:To>\n        <wsa:Action>http://CIS/BIR/PUBL/2014/07/IUslugaBIRzewnPubl/DaneSzukajPodmioty</wsa:Action>\n    </soap:Header>\n    <soap:Body>\n        <ns:DaneSzukajPodmioty>\n            <ns:pParametryWyszukiwania>\n                ".concat(params.Regon ? "<dat:Regon>".concat(params.Regon, "</dat:Regon>") : '', "\n                ").concat(params.Nip ? "<dat:Nip>".concat(params.Nip, "</dat:Nip>") : '', "\n                ").concat(params.Krs ? "<dat:Krs>".concat(params.Krs, "</dat:Krs>") : '', "\n                ").concat(params.Nipy ? "<dat:Nipy>".concat(params.Nipy.join(','), "</dat:Nipy>") : '', "\n                ").concat(params.Regony9zn ? "<dat:Regony9zn>".concat(params.Regony9zn.join(','), "</dat:Regony9zn>") : '', "\n                ").concat(params.Krsy ? "<dat:Krsy>".concat(params.Krsy, "</dat:Krsy>") : '', "\n                ").concat(params.Regony14zn ? "<dat:Regony14zn>".concat(params.Regony14zn, "</dat:Regony14zn>") : '', "\n            </ns:pParametryWyszukiwania>\n        </ns:DaneSzukajPodmioty>\n    </soap:Body>\n</soap:Envelope>\n"); };
exports.envelopeDaneSzukajPodmioty = envelopeDaneSzukajPodmioty;
